ArteryTek/framework-at32firmlib/AT32F403_Firmware_Library/libraries/drivers/inc/at32f403_gpio.h
/**
  **************************************************************************
  * @file     at32f403_gpio.h
  * @version  v2.0.3
  * @date     2022-06-28
  * @brief    at32f403 gpio header file
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

/* define to prevent recursive inclusion -------------------------------------*/
#ifndef __AT32F403_GPIO_H
#define __AT32F403_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif


/* includes ------------------------------------------------------------------*/
#include "at32f403.h"

/** @addtogroup AT32F403_periph_driver
  * @{
  */

/** @addtogroup GPIO
  * @{
  */

/** @defgroup GPIO_pins_number_definition
  * @{
  */

#define GPIO_PINS_0                      0x0001 /*!< gpio pins number 0 */
#define GPIO_PINS_1                      0x0002 /*!< gpio pins number 1 */
#define GPIO_PINS_2                      0x0004 /*!< gpio pins number 2 */
#define GPIO_PINS_3                      0x0008 /*!< gpio pins number 3 */
#define GPIO_PINS_4                      0x0010 /*!< gpio pins number 4 */
#define GPIO_PINS_5                      0x0020 /*!< gpio pins number 5 */
#define GPIO_PINS_6                      0x0040 /*!< gpio pins number 6 */
#define GPIO_PINS_7                      0x0080 /*!< gpio pins number 7 */
#define GPIO_PINS_8                      0x0100 /*!< gpio pins number 8 */
#define GPIO_PINS_9                      0x0200 /*!< gpio pins number 9 */
#define GPIO_PINS_10                     0x0400 /*!< gpio pins number 10 */
#define GPIO_PINS_11                     0x0800 /*!< gpio pins number 11 */
#define GPIO_PINS_12                     0x1000 /*!< gpio pins number 12 */
#define GPIO_PINS_13                     0x2000 /*!< gpio pins number 13 */
#define GPIO_PINS_14                     0x4000 /*!< gpio pins number 14 */
#define GPIO_PINS_15                     0x8000 /*!< gpio pins number 15 */
#define GPIO_PINS_ALL                    0xFFFF /*!< gpio all pins */

/**
  * @}
  */

#define IOMUX_MAKE_VALUE(reg_offset, bit_addr ,bit_num, bit_val) \
        (uint32_t)(((reg_offset) << 24) | ((bit_addr) << 16) | ((bit_num) << 8) | (bit_val))

/** @defgroup IOMUX_map_definition
  * @brief iomux map definitions
  * @{
  */

#define SPI1_MUX_01                      IOMUX_MAKE_VALUE(0x04, 0, 1, 0x01)  /*!< spi1_cs/i2s1_ws(pa15), spi1_sck/i2s1_ck(pb3), spi1_miso(pb4), spi1_mosi/i2s1_sd(pb5), i2s1_mck(pb0) */
#define SPI1_MUX_10                      IOMUX_MAKE_VALUE(0x04, 31, 1, 0x01) /*!< spi1_cs/i2s1_ws(pa4),  spi1_sck/i2s1_ck(pa5), spi1_miso(pa6), spi1_mosi/i2s1_sd(pa7), i2s1_mck(pb6) */
#define I2C1_MUX                         IOMUX_MAKE_VALUE(0x04, 1, 1, 0x01)  /*!< i2c1_scl(pb8),      i2c1_sda(pb9) */
#define USART1_MUX                       IOMUX_MAKE_VALUE(0x04, 2, 1, 0x01)  /*!< usart1_tx(pb6),     usart1_rx(pb7) */
#define USART2_MUX                       IOMUX_MAKE_VALUE(0x04, 3, 1, 0x01)  /*!< usart2_tx(pd5),     usart2_rx(pd6),  usart2_ck(pd7),  usart2_cts(pd3),  usart2_rts(pd4) */
#define USART3_MUX_01                    IOMUX_MAKE_VALUE(0x04, 4, 2, 0x01)  /*!< usart3_tx(pc10),    usart3_rx(pc11), usart3_ck(pc12), usart3_cts(pb13), usart3_rts(pb14) */
#define USART3_MUX_11                    IOMUX_MAKE_VALUE(0x04, 4, 2, 0x03)  /*!< usart3_tx(pd8),     usart3_rx(pd9),  usart3_ck(pd10), usart3_cts(pd11), usart3_rts(pd12) */
#define TMR1_MUX_01                      IOMUX_MAKE_VALUE(0x04, 6, 2, 0x01)  /*!< tmr1_ext(pa12),     tmr1_ch1(pa8),   tmr1_ch2(pa9),   tmr1_ch3(pa10),   tmr1_ch4(pa11), tmr1_brkin(pa6), tmr1_ch1c(pa7), tmr1_ch2c(pb0), tmr1_ch3c(pb1) */
#define TMR1_MUX_11                      IOMUX_MAKE_VALUE(0x04, 6, 2, 0x03)  /*!< tmr1_ext(pe7),      tmr1_ch1(pe9),   tmr1_ch2(pe11),  tmr1_ch3(pe13),   tmr1_ch4(pe14), tmr1_brkin(pe15), tmr1_ch1c(pe8), tmr1_ch2c(pe10), tmr1_ch3c(pe12) */
#define TMR2_MUX_01                      IOMUX_MAKE_VALUE(0x04, 8, 2, 0x01)  /*!< tmr2_ch1_ext(pa15), tmr2_ch2(pb3),   tmr2_ch3(pa2),   tmr2_ch4(pa3) */
#define TMR2_MUX_10                      IOMUX_MAKE_VALUE(0x04, 8, 2, 0x02)  /*!< tmr2_ch1_ext(pa0),  tmr2_ch2(pa1),   tmr2_ch3(pb10),  tmr2_ch4(pb11) */
#define TMR2_MUX_11                      IOMUX_MAKE_VALUE(0x04, 8, 2, 0x03)  /*!< tmr2_ch1_ext(pa15), tmr2_ch2(pb3),   tmr2_ch3(pb10),  tmr2_ch4(pb11) */
#define TMR3_MUX_10                      IOMUX_MAKE_VALUE(0x04, 10, 2, 0x02) /*!< tmr3_ch1(pb4),      tmr3_ch2(pb5),   tmr3_ch3(pb0),   tmr3_ch4(pb1) */
#define TMR3_MUX_11                      IOMUX_MAKE_VALUE(0x04, 10, 2, 0x03) /*!< tmr3_ch1(pc6),      tmr3_ch2(pc7),   tmr3_ch3(pc8),   tmr3_ch4(pc9) */
#define TMR4_MUX                         IOMUX_MAKE_VALUE(0x04, 12, 1, 0x01) /*!< tmr4_ch1(pd12),     tmr4_ch2(pd13),  tmr4_ch3(pd14),  tmr4_ch4(pd15) */
#define CAN_MUX_10                       IOMUX_MAKE_VALUE(0x04, 13, 2, 0x02) /*!< can_rx(pb8),        can_tx(pb9) */
#define CAN_MUX_11                       IOMUX_MAKE_VALUE(0x04, 13, 2, 0x03) /*!< can_rx(pd0),        can_tx(pd1) */
#define PD01_MUX                         IOMUX_MAKE_VALUE(0x04, 15, 1, 0x01) /*!< pd0/pd1 mapping on osc_in/osc_out */
#define TMR5CH4_MUX                      IOMUX_MAKE_VALUE(0x04, 16, 1, 0x01) /*!< lick connected to tmr5_ch4 input capture for calibration */
#define ADC1_ETP_MUX                     IOMUX_MAKE_VALUE(0x04, 17, 1, 0x01) /*!< adc1 external trigger preempted conversion muxing */
#define ADC1_ETO_MUX                     IOMUX_MAKE_VALUE(0x04, 18, 1, 0x01) /*!< adc1 external trigger ordinary conversion muxing */
#define ADC2_ETP_MUX                     IOMUX_MAKE_VALUE(0x04, 19, 1, 0x01) /*!< adc2 external trigger preempted conversion muxing */
#define ADC2_ETO_MUX                     IOMUX_MAKE_VALUE(0x04, 20, 1, 0x01) /*!< adc2 external trigger ordinary conversion muxing */
#define SWJTAG_MUX_001                   IOMUX_MAKE_VALUE(0x04, 24, 3, 0x01) /*!< full swj enabled  (jtag-dp  +  sw-dp)  but without jtrst */
#define SWJTAG_MUX_010                   IOMUX_MAKE_VALUE(0x04, 24, 3, 0x02) /*!< jtag-dp disabled and sw-dp enabled */
#define SWJTAG_MUX_100                   IOMUX_MAKE_VALUE(0x04, 24, 3, 0x04) /*!< full swj disabled  (jtag-dp  +  sw-dp) */

/**
  * @}
  */

/** @defgroup IOMUX_map2_definition
  * @brief iomux map2 definitions
  * @{
  */

#define TMR15_MUX                        IOMUX_MAKE_VALUE(0x1C, 0, 1, 0x01)  /*!< tmr15_ext(pf14),tmr15_ch1(pg2),tmr15_ch2(pg4),tmr15_ch3(pg6),tmr15_ch4(pf13),tmr15_brkin(pf15),tmr1_ch1c(pg3),tmr1_ch2c(pg5),tmr1_ch3c(pg7) */
#define TMR9_MUX                         IOMUX_MAKE_VALUE(0x1C, 5, 1, 0x01)  /*!< tmr9_ch1(pe5),   tmr9_ch2(pe6) */
#define TMR10_MUX                        IOMUX_MAKE_VALUE(0x1C, 6, 1, 0x01)  /*!< tmr10_ch1(pf6) */
#define TMR11_MUX                        IOMUX_MAKE_VALUE(0x1C, 7, 1, 0x01)  /*!< tmr11_ch1(pf7) */
#define TMR13_MUX                        IOMUX_MAKE_VALUE(0x1C, 8, 1, 0x01)  /*!< tmr13_ch1(pf8) */
#define TMR14_MUX                        IOMUX_MAKE_VALUE(0x1C, 9, 1, 0x01)  /*!< tmr14_ch1(pf9) */
#define XMC_NADV_MUX                     IOMUX_MAKE_VALUE(0x1C, 10, 1, 0x01) /*!< xmc_nadv not used */
#define SPI4_MUX                         IOMUX_MAKE_VALUE(0x1C, 17, 1, 0x01) /*!< spi4_cs/i2s4_ws(pe12), spi4_sck/i2s4_ck(pe11), spi4_miso(pe13), spi4_mosi/i2s4_sd(pe14), i2s4_mck(pc8) */
#define I2C3_MUX                         IOMUX_MAKE_VALUE(0x1C, 18, 1, 0x01) /*!< i2c3_scl(pa8), i2c3_sda(pb4) */
#define SDIO2_MUX01                      IOMUX_MAKE_VALUE(0x1C, 19, 2, 0x01) /*!< sdio2_ck(pc4), sdio2_cmd(pc5), sdio2_d0(pa4), sdio2_d1(pa5), sdio2_d2(pa6), sdio2_d3(pa7) */
#define SDIO2_MUX10                      IOMUX_MAKE_VALUE(0x1C, 19, 2, 0x02) /*!< sdio2_ck(pa2), sdio2_cmd(pa3), sdio2_d0(pc0), sdio2_d1(pc1), sdio2_d2(pc2), sdio2_d3(pc3), sdio2_d4(pa4), sdio2_d5(pa5), sdio2_d6(pa6), sdio2_d7(pa7) */
#define SDIO2_MUX11                      IOMUX_MAKE_VALUE(0x1C, 19, 2, 0x03) /*!< sdio2_ck(pa2), sdio2_cmd(pa3), sdio2_d0(pa4), sdio2_d1(pa5), sdio2_d2(pa6), sdio2_d3(pa7) */
#define EXT_SPIM_EN_MUX                  IOMUX_MAKE_VALUE(0x1C, 21, 1, 0x01) /*!< enable external spi-flash interface */

/**
  * @}
  */

